/**********************************************************************************************************************
**                            Copyright(C), oneonce. 2020-2025. All rights reserved.
***********************************************************************************************************************
**文件名称: mutex.h
**功能描述: 互斥锁接口
**作       者: oneonce
**日       期: 2020.04.16
**版       本: 1.0
**其       他:
***********************************************************************************************************************/
#ifndef __MUTEX_H__
#define __MUTEX_H__

#include <core/device.h>

#ifdef __cplusplus
extern "C" {
#endif






	typedef struct
	{
		device_t device;

		void (*lock)();
		bool (*trylock)();
		void (*unlock)();
	} mutex_t;



#ifdef __cplusplus
}
#endif

#endif // !__MUTEX_H__
