/**********************************************************************************************************************
**                            Copyright(C), oneonce. 2020-2025. All rights reserved.
***********************************************************************************************************************
*文件名称: device_driver_adc.h
*功能描述: ADC驱动接口
*作       者: oneonce
*日       期: 2020.04.13
*版       本: 1.0
*其       他:
***********************************************************************************************************************/
#ifndef __DEVICE_DRIVER_ADC_H__
#define __DEVICE_DRIVER_ADC_H__

#include <core/device.h>

#ifdef __cplusplus
extern "C" {
#endif




	typedef struct adc_message
	{
		uint32_t channel; // 通道
		uint32_t value; // 通道对应的ADC转换值
	} adc_message_t;


	/* ADC异步模式回调函数 */
	typedef void (*adc_convert_callback)(uint16_t device_id, adc_message_t* msg, int32_t msg_cnt);



	typedef struct device_driver_adc
	{
		device_t device;

		/**********************************************************************************************************************
		**函数名称: open
		**功能描述: 打开指定的ADC通道
		**输入参数:
		**                channel: 待打开的通道(若无通道，则忽略)
		**输出参数: 无
		**函数返回: 无
		**********************************************************************************************************************/
		void (*open)(uint32_t channel);

		/**********************************************************************************************************************
		**函数名称: close
		**功能描述: 关闭指定的ADC通道
		**输入参数:
		**                channel: 待关闭的通道(若无通道，则忽略)
		**输出参数: 无
		**函数返回: 无
		**********************************************************************************************************************/
		void (*close)(uint32_t channel);

		/**********************************************************************************************************************
		**函数名称: get_resolution
		**功能描述: 获取通道分辨率
		**                如：10bit = 1024, 12bit = 4096, 16bit = 65536 ...
		**输入参数:
		**                channel: 通道(若无通道，则忽略)
		**输出参数: 无
		**函数返回: 无
		**********************************************************************************************************************/
		uint32_t (*get_resolution)(uint32_t channel);

		/**********************************************************************************************************************
		**函数名称: read
		**功能描述: 读指定通道ADC转换的值
		**输入参数:
		**                channel: 通道(若无通道，则忽略)
		**输出参数: 无
		**函数返回: ADC转换值
		**********************************************************************************************************************/
		uint32_t (*read)(uint32_t channel);

		/**********************************************************************************************************************
		**函数名称: register_convert_callback
		**功能描述: 注册指定通道ADC转换回调函数
		**					注: 转换回调函数需在open之前打开
		**输入参数:
		**                channel: 通道(若无通道，则忽略)
		**                callback: 回调函数
		**输出参数: 无
		**函数返回: 无
		**********************************************************************************************************************/
		void (*register_convert_callback)(uint32_t channel, adc_convert_callback callback);
	} device_driver_adc_t;


#ifdef __cplusplus
}
#endif

#endif // !__DEVICE_DRIVER_ADC_H__

