/**********************************************************************************************************************
**                            Copyright(C), oneonce. 2020-2025. All rights reserved.
***********************************************************************************************************************
*文件名称: device_driver_ext_irq.h
*功能描述: 外部中断驱动接口
*作       者: oneonce
*日       期: 2020.04.17
*版       本: 1.0
*其       他:
***********************************************************************************************************************/
#ifndef __DEVICE_DRIVER_EXT_IRQ_H__
#define __DEVICE_DRIVER_EXT_IRQ_H__
#include <core/device.h>

#ifdef __cplusplus
extern "C" {
#endif





	/* 外部中断回调函数 */
	typedef void (*ext_irq_callback)(uint16_t device_id, uint32_t pin, enum IO_LEVEL_EDGE level_edge);






	typedef struct device_driver_ext_irq
	{
		device_t device;

		/**********************************************************************************************************************
		**函数名称: open
		**功能描述: 打开指定引脚对应的外部中断
		**输入参数:
		**                pin: 待打开的I/O
		**输出参数: 无
		**函数返回: 无
		**********************************************************************************************************************/
		void (*open)(uint32_t pin);

		/**********************************************************************************************************************
		**函数名称: close
		**功能描述: 关闭指定引脚对应的外部中断
		**输入参数:
		**                pin: 待关闭的I/O
		**输出参数: 无
		**函数返回: 无
		**********************************************************************************************************************/
		void (*close)(uint32_t pin);

		/**********************************************************************************************************************
		**函数名称: register_callback
		**功能描述: 注册外部中断回调函数
		**                注:
		**                1. 必须在open之前注册
		**输入参数:
		**                pin: 引脚
		**                callback: 回调函数
		**输出参数: 无
		**函数返回: 无
		**********************************************************************************************************************/
		void (*register_callback)(uint32_t pin, ext_irq_callback callback);

	} device_driver_ext_irq_t;



#ifdef __cplusplus
}
#endif

#endif // !__DEVICE_DRIVER_EXT_IRQ_H__
