/**********************************************************************************************************************
**                            Copyright(C), oneonce. 2020-2025. All rights reserved.
***********************************************************************************************************************
**文件名称: device_bus.h
**功能描述: 设备总线定义
**作       者: oneonce
**日       期: 2020.03.27
**版       本: 1.0
**其       他:
***********************************************************************************************************************/
#ifndef __DEVICE_BUS_H__
#define __DEVICE_BUS_H__
#include <core/types.h>

#ifdef __cplusplus
extern "C" {
#endif





/* 总线ID定义，如果需要添加更多的总线，则在Max之前添加 */
enum DEVICE_BUS_ID
{
	DEVICE_BUS_DEFAULT = 0, // 默认总线

	DEVICE_BUS_MAX // 新的总线类型在此之前添加(设备驱动管理需使用MAX)
};


#ifdef __cplusplus
}
#endif

#endif // !__DEVICE_BUS_H__
