/**********************************************************************************************************************
**                            Copyright(C), oneonce. 2020-2025. All rights reserved.
***********************************************************************************************************************
**文件名称: device_macro.h
**功能描述: 设备驱动宏定义
**作       者: oneonce
**日       期: 2020.03.29
**版       本: 1.0
**其       他:
***********************************************************************************************************************/
#ifndef __DEVICE_MACRO_H__
#define __DEVICE_MACRO_H__

#ifdef __cplusplus
extern "C" {
#endif




#define DEVICE_ID_USR_BASE						1024 // 用户自定义设备ID最小值






#ifdef __cplusplus
}
#endif

#endif // !__DEVICE_MACRO_H__
