/**********************************************************************************************************************
**                            Copyright(C), oneonce. 2020-2025. All rights reserved.
***********************************************************************************************************************
**文件名称: device_error.h
**功能描述: 设备驱动错误定义
**作       者: oneonce
**日       期: 2020.03.29
**版       本: 1.0
**其       他:
***********************************************************************************************************************/
#ifndef __DEVICE_ERROR_H__
#define __DEVICE_ERROR_H__

#ifdef __cplusplus
extern "C" {
#endif






enum DEVICE_ERROR
{
	DEV_ERR_SUCCESS = 0,
	DEV_ERR_FAILE = -1, // 未定义的错误
	DEV_ERR_PARA = -2, // 参数错误
	DEV_ERR_NO_MEM = -3, // 内存不足
	DEV_ERR_SYNC_CALL = -4, // 异步模式调用同步方法错误
};


#ifdef __cplusplus
}
#endif

#endif // !__DEVICE_ERROR_H__
